sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
/**
 ******************************************************************************
 * @file    ethernetif.c
 * @brief   STM32H5 LwIP Ethernet Interface with HAL callback model
 * @note    Clean implementation with proper buffer tracking to prevent RBU
 * errors. Each buffer can only be assigned to ONE descriptor at a time.
 ******************************************************************************
 */

/* Enable debug logging - set to 1 to enable, 0 to disable */
#define ETH_DEBUG_ENABLE 0

#if ETH_DEBUG_ENABLE
#include <stdio.h>
#define ETH_DEBUG(fmt, ...) \
    printf("[ETH %lu] " fmt "\r\n", HAL_GetTick(), ##__VA_ARGS__)
#else
#define ETH_DEBUG(fmt, ...) ((void)0)
#endif

#include <string.h>

#include "FreeRTOS.h"
#include "ethernetif.h"
#include "lan8742.h"
#include "lwip/etharp.h"
#include "lwip/mem.h"
#include "lwip/memp.h"
#include "lwip/opt.h"
#include "lwip/pbuf.h"
#include "lwip/stats.h"
#include "lwip/tcpip.h"
#include "lwip/timeouts.h"
#include "main.h"
#include "netif/ethernet.h"
#include "semphr.h"
#include "stm32h5xx_hal.h"
#include "task.h"

#define ETHIF_TX_TIMEOUT            (2000U)
#define INTERFACE_THREAD_STACK_SIZE (1024)
#define IFNAME0                     's'
#define IFNAME1                     't'
#define ETH_RX_BUFFER_SIZE          (1536U)

/* MAC address is defined in ethernetif.h - single source of truth */

/* DMA Descriptors in SRAM3 (non-cacheable) - defined in main.c */
extern ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT];
extern ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT];

/* Use the ETH handle from main.c */
extern ETH_HandleTypeDef heth;

/* RX buffers in SRAM3 for cache coherency
 * IMPORTANT: We need MORE buffers than descriptors to handle the case where
 * some buffers are being processed by the application while DMA needs new ones.
 * Using 2x the descriptor count gives us headroom.
 */
#define RX_BUFFER_COUNT (ETH_RX_DESC_CNT * 2)
static uint8_t RxBuff[RX_BUFFER_COUNT][ETH_RX_BUFFER_SIZE]
    __attribute__((section(".driver.eth_mac0_rx_buf"), aligned(32)));

/* Buffer tracking:
 * - RxBuffAssigned: Bitmask tracking which buffers are currently assigned to
 * DMA descriptors
 * - A buffer is "assigned" from when RxAllocateCallback returns it until
 * RxLinkCallback processes it
 * - After RxLinkCallback, the HAL clears BackupAddr0, and the next
 * RxAllocateCallback can reuse it
 */
static volatile uint32_t RxBuffAssigned =
    0; /* Bitmask: bit N = buffer N assigned to DMA */
static volatile uint32_t CurrentRxBuffIdx = 0;

static SemaphoreHandle_t RxPktSemaphore = NULL;
static SemaphoreHandle_t TxPktSemaphore = NULL;
static TaskHandle_t      EthIfThread    = NULL;

/* Static semaphore buffers for FreeRTOS */
static StaticSemaphore_t RxSemaphoreBuffer;
static StaticSemaphore_t TxSemaphoreBuffer;

static lan8742_Object_t LAN8742;

/* Forward declarations */
static void    ethernetif_input_task(void *argument);
static int32_t ETH_PHY_IO_Init(void);
static int32_t ETH_PHY_IO_DeInit(void);
static int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr,
                                  uint32_t *pRegVal);
static int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr,
                                   uint32_t RegVal);
static int32_t ETH_PHY_IO_GetTick(void);

static lan8742_IOCtx_t LAN8742_IOCtx = {ETH_PHY_IO_Init, ETH_PHY_IO_DeInit,
                                        ETH_PHY_IO_WriteReg, ETH_PHY_IO_ReadReg,
                                        ETH_PHY_IO_GetTick};

static int32_t ETH_PHY_IO_Init(void)
{
    HAL_ETH_SetMDIOClockRange(&heth);
    return 0;
}
static int32_t ETH_PHY_IO_DeInit(void) { return 0; }
static int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr,
                                  uint32_t *pRegVal)
{
    return (HAL_ETH_ReadPHYRegister(&heth, DevAddr, RegAddr, pRegVal) == HAL_OK)
               ? 0
               : -1;
}
static int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr,
                                   uint32_t RegVal)
{
    return (HAL_ETH_WritePHYRegister(&heth, DevAddr, RegAddr, RegVal) == HAL_OK)
               ? 0
               : -1;
}
static int32_t ETH_PHY_IO_GetTick(void) { return (int32_t)HAL_GetTick(); }

/**
 * @brief  Find buffer index from buffer address
 * @param  buff: Buffer address to find
 * @retval Buffer index or -1 if not found
 */
static int32_t find_rx_buffer_index(uint8_t *buff)
{
    for (uint32_t i = 0; i < RX_BUFFER_COUNT; i++)
    {
        if (buff == &RxBuff[i][0])
        {
            return (int32_t)i;
        }
    }
    return -1;
}

/**
 * @brief  HAL ETH RX Allocate Callback - Allocates buffer for DMA descriptor
 * @param  buff: Pointer to receive buffer pointer
 * @note   This is the KEY function for preventing RBU errors!
 *         We track which buffers are assigned to DMA and only return free ones.
 *         A buffer is marked as "assigned" here and freed in RxLinkCallback.
 */
void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
    uint32_t startIdx = CurrentRxBuffIdx;

    /* Find a free buffer using round-robin search */
    for (uint32_t i = 0; i < RX_BUFFER_COUNT; i++)
    {
        uint32_t idx  = (startIdx + i) % RX_BUFFER_COUNT;
        uint32_t mask = (1U << idx);

        /* Check if buffer is free (not assigned to any descriptor) */
        if ((RxBuffAssigned & mask) == 0)
        {
            /* Mark buffer as assigned to DMA */
            RxBuffAssigned |= mask;
            CurrentRxBuffIdx = (idx + 1) % RX_BUFFER_COUNT;
            *buff            = &RxBuff[idx][0];
            return;
        }
    }

    /* No buffer available - this will cause RBU error! */
    ETH_DEBUG("RxAlloc FAILED! No free buffers", 0);
    *buff = NULL;
}

/**
 * @brief  HAL ETH RX Link Callback - Links received data to pbuf chain
 * @param  pStart: Pointer to start of pbuf chain
 * @param  pEnd: Pointer to end of pbuf chain
 * @param  buff: Pointer to received data buffer
 * @param  Length: Length of received data
 * @note   We copy data from DMA buffer to a new pbuf, then FREE the buffer
 *         so it can be reused by RxAllocateCallback.
 */
void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff,
                            uint16_t Length)
{
    struct pbuf **ppStart = (struct pbuf **)pStart;
    struct pbuf **ppEnd   = (struct pbuf **)pEnd;
    struct pbuf  *p;
    int32_t       bufIdx;

    /* Find buffer index and mark it as free */
    bufIdx = find_rx_buffer_index(buff);
    if (bufIdx >= 0)
    {
        /* Clear the assigned bit - buffer is now free for reuse */
        RxBuffAssigned &= ~(1U << bufIdx);
    }

    /* Allocate a pbuf for the received frame segment */
    p = pbuf_alloc(PBUF_RAW, Length, PBUF_POOL);

    if (p != NULL)
    {
        /* Data Synchronization Barrier before reading DMA buffer */
        __DSB();
        pbuf_take(p, buff, Length);

        /* Chain the pbuf */
        if (*ppStart == NULL)
        {
            *ppStart = p;
        }
        else if (*ppEnd != NULL)
        {
            pbuf_cat(*ppEnd, p);
        }
        *ppEnd = p;
    }
    else
    {
        ETH_DEBUG("pbuf_alloc FAILED!", 0);
    }
}

static void low_level_init(struct netif *netif)
{
    uint32_t             duplex, speed = 0U;
    int32_t              PHYLinkState;
    ETH_MACConfigTypeDef MACConf = {0};
    HAL_StatusTypeDef    hal_status;

    ETH_DEBUG("low_level_init: Starting", 0);

    /* Initialize buffer tracking - all buffers free */
    RxBuffAssigned   = 0;
    CurrentRxBuffIdx = 0;

    /* Get MAC address from Unique Device ID */
    ethernetif_get_mac_addr(netif->hwaddr);
    netif->hwaddr_len = ETH_HWADDR_LEN;
    netif->mtu        = ETH_MAX_PAYLOAD;
    netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP;

    ETH_DEBUG("MAC: %02X:%02X:%02X:%02X:%02X:%02X", netif->hwaddr[0],
              netif->hwaddr[1], netif->hwaddr[2], netif->hwaddr[3],
              netif->hwaddr[4], netif->hwaddr[5]);

    /* Create semaphores */
    RxPktSemaphore = xSemaphoreCreateBinaryStatic(&RxSemaphoreBuffer);
    TxPktSemaphore = xSemaphoreCreateBinaryStatic(&TxSemaphoreBuffer);

    /* Create RX task */
    static StaticTask_t xTaskBuffer;
    static StackType_t  xStack[INTERFACE_THREAD_STACK_SIZE];
    EthIfThread = xTaskCreateStatic(
        ethernetif_input_task, "EthIf", INTERFACE_THREAD_STACK_SIZE, netif,
        configMAX_PRIORITIES - 1, xStack, &xTaskBuffer);

    /* Initialize PHY */
    LAN8742_RegisterBusIO(&LAN8742, &LAN8742_IOCtx);
    if (LAN8742_Init(&LAN8742) != LAN8742_STATUS_OK)
    {
        ETH_DEBUG("PHY init FAILED!", 0);
        netif_set_link_down(netif);
        netif_set_down(netif);
        return;
    }

    PHYLinkState = LAN8742_GetLinkState(&LAN8742);

    /* Don't start ETH if link is down - wait for link to come up */
    if (PHYLinkState <= LAN8742_STATUS_LINK_DOWN)
    {
        ETH_DEBUG("Link DOWN, deferring ETH start", 0);
        netif_set_up(netif);
        netif_set_link_down(netif);
        return;
    }

    /* Configure speed/duplex based on PHY state */
    switch (PHYLinkState)
    {
        case LAN8742_STATUS_100MBITS_FULLDUPLEX:
            duplex = ETH_FULLDUPLEX_MODE;
            speed  = ETH_SPEED_100M;
            break;
        case LAN8742_STATUS_100MBITS_HALFDUPLEX:
            duplex = ETH_HALFDUPLEX_MODE;
            speed  = ETH_SPEED_100M;
            break;
        case LAN8742_STATUS_10MBITS_FULLDUPLEX:
            duplex = ETH_FULLDUPLEX_MODE;
            speed  = ETH_SPEED_10M;
            break;
        case LAN8742_STATUS_10MBITS_HALFDUPLEX:
            duplex = ETH_HALFDUPLEX_MODE;
            speed  = ETH_SPEED_10M;
            break;
        default:
            duplex = ETH_FULLDUPLEX_MODE;
            speed  = ETH_SPEED_100M;
            break;
    }

    HAL_ETH_GetMACConfig(&heth, &MACConf);
    MACConf.DuplexMode = duplex;
    MACConf.Speed      = speed;
    HAL_ETH_SetMACConfig(&heth, &MACConf);

    /* Memory barriers before starting DMA */
    __DSB();
    __ISB();

    hal_status = HAL_ETH_Start_IT(&heth);

    if (hal_status == HAL_OK)
    {
        netif_set_up(netif);
        netif_set_link_up(netif);
        ETH_DEBUG("ETH started, Link UP", 0);
    }
    else
    {
        ETH_DEBUG("HAL_ETH_Start_IT FAILED!", 0);
        netif_set_down(netif);
        netif_set_link_down(netif);
    }
}

static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
    (void)netif;
    uint32_t          i = 0U;
    struct pbuf      *q;
    ETH_BufferTypeDef Txbuffer[ETH_TX_DESC_CNT];
    HAL_StatusTypeDef tx_status;

    /* Update link statistics */
    LINK_STATS_INC(link.xmit);

    /* Log TX packet details */
    uint8_t *data = (uint8_t *)p->payload;
    (void)data;
    ETH_DEBUG("TX: len=%u, dst=%02X:%02X:%02X:%02X:%02X:%02X, type=0x%02X%02X",
              (unsigned)p->tot_len, data[0], data[1], data[2], data[3], data[4],
              data[5], data[12], data[13]);

    memset(Txbuffer, 0, ETH_TX_DESC_CNT * sizeof(ETH_BufferTypeDef));
    for (q = p; q != NULL; q = q->next)
    {
        if (i >= ETH_TX_DESC_CNT) return ERR_IF;
        Txbuffer[i].buffer = q->payload;
        Txbuffer[i].len    = q->len;
        if (i > 0) Txbuffer[i - 1].next = &Txbuffer[i];
        if (q->next == NULL) Txbuffer[i].next = NULL;
        i++;
    }

    ETH_TxPacketConfigTypeDef localTxConfig = {0};
    localTxConfig.Attributes                = ETH_TX_PACKETS_FEATURES_CRCPAD;
    localTxConfig.ChecksumCtrl              = ETH_CHECKSUM_DISABLE;
    localTxConfig.CRCPadCtrl                = ETH_CRC_PAD_INSERT;
    localTxConfig.Length                    = p->tot_len;
    localTxConfig.TxBuffer                  = Txbuffer;
    localTxConfig.pData                     = p;

    pbuf_ref(p);

    /* Memory barrier before TX */
    __DSB();

    /* Before trying to transmit a new packet, release any completed packets
     * to free their pbufs. This executes safely in the task context. */
    HAL_ETH_ReleaseTxPacket(&heth);

    /* Clear any old errors before attempting transmission */
    heth.ErrorCode = HAL_ETH_ERROR_NONE;
    tx_status      = HAL_ETH_Transmit_IT(&heth, &localTxConfig);

    while (tx_status != HAL_OK)
    {
        if (HAL_ETH_GetError(&heth) & HAL_ETH_ERROR_BUSY)
        {
            /* Wait for TX complete semaphore */
            (void)xSemaphoreTake(TxPktSemaphore,
                                 pdMS_TO_TICKS(ETHIF_TX_TIMEOUT));

            /* TX completed, safely release packets here in task context */
            HAL_ETH_ReleaseTxPacket(&heth);

            /* Clear error code again before retry */
            heth.ErrorCode = HAL_ETH_ERROR_NONE;
            tx_status      = HAL_ETH_Transmit_IT(&heth, &localTxConfig);
        }
        else
        {
            ETH_DEBUG("TX FAILED!", 0);
            pbuf_free(p);
            return ERR_IF;
        }
    }
    return ERR_OK;
}

static struct pbuf *low_level_input(struct netif *netif)
{
    (void)netif;
    struct pbuf *p = NULL;

    if (HAL_ETH_ReadData(&heth, (void **)&p) == HAL_OK && p != NULL)
    {
        __DSB();
        /* Update link statistics */
        LINK_STATS_INC(link.recv);

        /* Log packet details including first bytes for protocol identification
         */
        uint8_t *data = (uint8_t *)p->payload;
        (void)data;
        ETH_DEBUG(
            "RX: len=%u, dst=%02X:%02X:%02X:%02X:%02X:%02X, type=0x%02X%02X",
            (unsigned)p->tot_len, data[0], data[1], data[2], data[3], data[4],
            data[5], data[12], data[13]);
    }
    return p;
}

void ethernetif_input(struct netif *netif)
{
    struct pbuf *p;
    p = low_level_input(netif);
    if (p != NULL)
    {
        err_t err = netif->input(p, netif);
        if (err != ERR_OK)
        {
            ETH_DEBUG("netif->input FAILED: err=%d", (int)err);
            pbuf_free(p);
        }
    }
}

/* Counter for RX interrupts - for debugging */
static volatile uint32_t RxIntCount = 0;

/* Debug counters for semaphore takes and packets processed */
static volatile uint32_t SemTakeCount      = 0;
static volatile uint32_t PktProcessedCount = 0;

static void ethernetif_input_task(void *argument)
{
    struct pbuf  *p;
    struct netif *netif = (struct netif *)argument;

    for (;;)
    {
        if (xSemaphoreTake(RxPktSemaphore, pdMS_TO_TICKS(5000)) == pdTRUE)
        {
            SemTakeCount++;
            do
            {
                p = low_level_input(netif);
                if (p != NULL)
                {
                    PktProcessedCount++;
                    if (netif->input(p, netif) != ERR_OK)
                    {
                        ETH_DEBUG("netif->input FAILED!", 0);
                        pbuf_free(p);
                    }
                }
            } while (p != NULL);
        }
    }
}

err_t ethernetif_init(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
#if LWIP_NETIF_HOSTNAME
    netif->hostname = "lwip";
#endif
    netif->name[0]    = IFNAME0;
    netif->name[1]    = IFNAME1;
    netif->output     = etharp_output;
    netif->linkoutput = low_level_output;
    low_level_init(netif);
    return ERR_OK;
}

void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth_param)
{
    (void)heth_param;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    RxIntCount++;
    if (RxPktSemaphore)
    {
        xSemaphoreGiveFromISR(RxPktSemaphore, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

/* Debug function to get semaphore take count */
uint32_t ethernetif_get_sem_take_count(void) { return SemTakeCount; }

/* Debug function to get processed packet count */
uint32_t ethernetif_get_pkt_processed_count(void) { return PktProcessedCount; }

uint32_t ethernetif_get_rx_int_count(void) { return RxIntCount; }

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth_param)
{
    (void)heth_param;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* We MUST NOT call HAL_ETH_ReleaseTxPacket here because it calls
     * pbuf_free() via HAL_ETH_TxFreeCallback. FreeRTOS mutexes (used by LwIP
     * memory manager) cannot be taken in an ISR! We simply signal the
     * TxPktSemaphore. */
    if (TxPktSemaphore)
    {
        xSemaphoreGiveFromISR(TxPktSemaphore, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

/**
 * @brief  HAL ETH TX Free Callback - Frees pbuf after transmission completes
 * @param  buff: Pointer to the packet data (actually a pbuf pointer cast to
 * uint32_t*)
 * @note   This callback is invoked by HAL_ETH_ReleaseTxPacket() for each
 *         transmitted packet. The buff parameter is the pData field from
 *         ETH_TxPacketConfigTypeDef, which we set to the pbuf pointer.
 *
 *         Without this callback, transmitted pbufs are never freed, causing
 *         heap exhaustion during sustained traffic.
 */
void HAL_ETH_TxFreeCallback(uint32_t *buff)
{
    /* The buff parameter is actually the pbuf pointer we stored in
     * TxConfig.pData */
    struct pbuf *p = (struct pbuf *)buff;

    if (p != NULL)
    {
        /* Free the pbuf - this decrements the reference count.
         * The pbuf was ref'd in low_level_output() before transmission. */
        pbuf_free(p);
    }
}

void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth_param)
{
    uint32_t error = HAL_ETH_GetDMAError(heth_param);

    if (error & ETH_DMACSR_RBU)
    {
        ETH_DEBUG("RBU Error - restarting RX DMA", 0);
        /* Restart RX DMA by writing tail pointer */
        __DMB();
        WRITE_REG(heth_param->Instance->DMACRDTPR,
                  (uint32_t)(heth_param->Init.RxDesc + (ETH_RX_DESC_CNT - 1U)));
    }

    if (error & ETH_DMACSR_TBU)
    {
        ETH_DEBUG("TBU Error - restarting TX DMA", 0);
        __DMB();
        WRITE_REG(heth_param->Instance->DMACTDTPR,
                  (uint32_t)(heth_param->Init.TxDesc + (ETH_TX_DESC_CNT - 1U)));
    }
}

/**
 * @brief  Check if PHY link state indicates link is truly UP
 */
static inline int is_phy_link_up(int32_t state)
{
    return (state >= LAN8742_STATUS_100MBITS_FULLDUPLEX &&
            state <= LAN8742_STATUS_10MBITS_HALFDUPLEX);
}

#include "lwip/tcpip.h"

struct link_update_msg
{
    struct netif *netif;
    int32_t       phy_state;
};

static void ethernetif_update_link_state(void *ctx)
{
    struct link_update_msg *msg          = (struct link_update_msg *)ctx;
    struct netif           *netif        = msg->netif;
    int32_t                 PHYLinkState = msg->phy_state;

    /* Link was up, now it's down */
    if (netif_is_link_up(netif) && !is_phy_link_up(PHYLinkState))
    {
        ETH_DEBUG("Link DOWN", 0);
        HAL_ETH_Stop_IT(&heth);
        netif_set_down(netif);
        netif_set_link_down(netif);
    }
    /* Link was down, now it's up */
    else if (!netif_is_link_up(netif) && is_phy_link_up(PHYLinkState))
    {
        ETH_MACConfigTypeDef MACConf = {0};
        uint32_t duplex = ETH_FULLDUPLEX_MODE, speed = ETH_SPEED_100M;

        ETH_DEBUG("Link UP", 0);

        switch (PHYLinkState)
        {
            case LAN8742_STATUS_100MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed  = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_100MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed  = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_10MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed  = ETH_SPEED_10M;
                break;
            case LAN8742_STATUS_10MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed  = ETH_SPEED_10M;
                break;
            default:
                break;
        }
        HAL_ETH_GetMACConfig(&heth, &MACConf);
        MACConf.DuplexMode = duplex;
        MACConf.Speed      = speed;
        HAL_ETH_SetMACConfig(&heth, &MACConf);

        /* Reset buffer tracking before starting ETH */
        RxBuffAssigned   = 0;
        CurrentRxBuffIdx = 0;

        /* Memory barriers before starting DMA */
        __DSB();
        __ISB();

        /* Start ETH - let HAL handle descriptor initialization */
        if (HAL_ETH_Start_IT(&heth) == HAL_OK)
        {
            netif_set_up(netif);
            netif_set_link_up(netif);
            ETH_DEBUG("ETH started", 0);
        }
        else
        {
            ETH_DEBUG("HAL_ETH_Start_IT FAILED!", 0);
        }
    }

    /* Free the allocated message */
    mem_free(msg);
}

void ethernetif_check_link(struct netif *netif)
{
    int32_t PHYLinkState = LAN8742_GetLinkState(&LAN8742);

    uint8_t is_up  = netif_is_link_up(netif) ? 1 : 0;
    uint8_t phy_up = is_phy_link_up(PHYLinkState) ? 1 : 0;

    if (is_up != phy_up)
    {
        /* Post to tcpip_thread to avoid data races on LwIP structures and ETH
         * HAL */
        struct link_update_msg *msg = (struct link_update_msg *)mem_malloc(
            sizeof(struct link_update_msg));
        if (msg != NULL)
        {
            msg->netif     = netif;
            msg->phy_state = PHYLinkState;
            if (tcpip_callback(ethernetif_update_link_state, msg) != ERR_OK)
            {
                mem_free(msg);
            }
        }
    }
}

void ethernetif_poll(struct netif *netif) { ethernetif_input(netif); }

void ethernet_link_thread(void *argument)
{
    struct netif *netif = (struct netif *)argument;

    for (;;)
    {
        ethernetif_check_link(netif);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}
